app/Controllers/Profil.php

SELECT *
FROM `userinfo`
WHERE `email` = 'bernaldo.n70@gmail.com'
---
    public function __construct()
    {
        $this->db = db_connect();
        $this->userinfo = $this->db->table('userinfo');

        $this->email = service('authentication')->user()->email;
        $this->user = $this->userinfo->where('email', $this->email)->get()->getRowArray();