app/Controllers/Regsosek2022.php

    public function __construct()
    {
        $this->db = db_connect();
        $this->userinfo = $this->db->table('userinfo');

        $this->email = service('authentication')->user()->email;
        $this->user = $this->userinfo->where('email', $this->email)->get()->getRowArray();
---
SELECT *
FROM `userinfo`
WHERE `email` = 'bernaldo.n70@gmail.com'

    public function arusdokumenedit($kodewilayah)
    {
        if ($this->request->getPost() == null) {
            $data['arusdokumen'] = $this->sls->select('sls.*, arusdk.diterima_ipds, arusdk.diterima_mitra, arusdk.mitra, arusdk.kembali_tu, arusdk.ket')
                ->join('regsosek2022_arusdokumen as arusdk', 'sls.k_wil = arusdk.k_wil', 'left')
                ->where('sls.k_wil', $kodewilayah)
                ->get()->getRowArray();

            $data['mitras'] = $this->userinfo->select('email, nama')
                ->where('regsosek2022', 1)->get()->getResultArray();

            return view('templates/header')
                . view('templates/sidebar', $this->user)
                . view('templates/topbar')
                . view('regsosek2022/arusdokumenedit', $data);
        } else {
            if ($this->arusdokumen->where('k_wil', $kodewilayah)->get()->getResult() == null) {
                $this->arusdokumen->insert([
                    'k_wil' => $kodewilayah,
                    'ket' => strtoupper($this->request->getPost('ket')),
                    'diterima_ipds' => $this->request->getPost('diterima_ipds'),
                    'diterima_mitra' => $this->request->getPost('diterima_mitra'),
                    'mitra' => strtoupper($this->request->getPost('mitra')),
                    'kembali_tu' => $this->request->getPost('kembali_tu'),
                ]);
            } else {
                $this->arusdokumen->set([
                    'ket' => strtoupper($this->request->getPost('ket')),
                    'diterima_mitra' => $this->request->getPost('diterima_mitra'),
                    'mitra' => strtoupper($this->request->getPost('mitra')),
                    'kembali_tu' => $this->request->getPost('kembali_tu'),
                ])->where('k_wil', $kodewilayah)->update();
---
SELECT *
FROM `regsosek2022_arusdokumen` as `ad`
WHERE `k_wil` = '1206040010000500'
SELECT *
FROM `regsosek2022_arusdokumen` as `ad`
JOIN `regsosek2022_dokumenerror` as `e` ON `ad`.`k_wil` = `e`.`k_wil`
WHERE `ad`.`k_wil` = '1206030006000100'

    public function dokumenerrorlihat($kodewilayah, $id = null)
    {
        if ($id == null) {
            $data['dokumenerror'] = $this->arusdokumen->where('ad.k_wil', $kodewilayah)
                ->join('regsosek2022_dokumenerror as e', 'ad.k_wil = e.k_wil')
                ->get()->getResultArray();

            // dd($data);

            // $dat = $this->arusdokumen->select('ad.k_wil')->distinct()
            //     ->join('regsosek2022_dokumenerror as e', 'ad.k_wil = e.k_wil')
            //     ->get()->getResultArray();
            // dd($dat);

            return view('templates/header')
                . view('templates/sidebar', $this->user)
                . view('templates/topbar')
                . view('regsosek2022/dokumenerrorlihat', $data);
        } else {
            if ($this->request->getPost() != null) {
                $this->dokumenerror->set([
                    'validasi' => strtoupper($this->request->getPost('validasi')),
                    'perlakuan' => $this->request->getPost('perlakuan'),
                ])->where('id', $id)->update();
---
SELECT *
FROM `regsosek2022_dokumenerror` as `de`
WHERE `id` = '2321'